# RbsPipeJointtypeParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeJointtypeParam Property
ParameterTypeId Class See Also
---
"Connection Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeJointtypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeJointtypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeJointtypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace